TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0c1105_c1106.h
/* IOMUX_PINCM7[PF] Bits */
#define IOMUX_PINCM7_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM7_PF_GPIOA_DIO04                   ((uint32_t)0X00000001)
#define IOMUX_PINCM7_PF_TIMG8_CCP1                    ((uint32_t)0X00000002)
#define IOMUX_PINCM7_PF_SPI0_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM7_PF_I2C1_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM7_PF_TIMA0_CCP1_CMPL               ((uint32_t)0X00000005)
#define IOMUX_PINCM7_PF_SYSCTL_LFCLKIN                ((uint32_t)0X00000006)
#define IOMUX_PINCM7_PF_TIMG2_CCP1                    ((uint32_t)0X00000007)
#define IOMUX_PINCM7_PF_TIMA0_CCP3                    ((uint32_t)0X00000008)
#define IOMUX_PINCM7_PF_UART2_RTS                     ((uint32_t)0X00000009)
#define IOMUX_PINCM7_PF_UART1_RX                      ((uint32_t)0X0000000A)
#define IOMUX_PINCM7_PF_SPI0_CS0                      ((uint32_t)0X0000000B)
#define IOMUX_PINCM7_PF_TIMA0_CCP0_CMPL               ((uint32_t)0X0000000C)
#define IOMUX_PINCM7_PF_SYSCTL_HFCLKIN                ((uint32_t)0X0000000D)

/* IOMUX_PINCM8[PF] Bits */
#define IOMUX_PINCM8_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM8_PF_GPIOA_DIO05                   ((uint32_t)0X00000001)
#define IOMUX_PINCM8_PF_TIMG8_CCP0                    ((uint32_t)0X00000002)
#define IOMUX_PINCM8_PF_SPI0_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM8_PF_I2C1_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM8_PF_TIMG14_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM8_PF_SYSCTL_FCC_IN                 ((uint32_t)0X00000006)
#define IOMUX_PINCM8_PF_TIMG1_CCP0                    ((uint32_t)0X00000007)
#define IOMUX_PINCM8_PF_TIMA_FAULT1                   ((uint32_t)0X00000008)
#define IOMUX_PINCM8_PF_UART0_CTS                     ((uint32_t)0X00000009)
#define IOMUX_PINCM8_PF_UART1_TX                      ((uint32_t)0X0000000B)
#define IOMUX_PINCM8_PF_TIMA0_CCP1                    ((uint32_t)0X0000000C)

/* IOMUX_PINCM9[PF] Bits */
#define IOMUX_PINCM9_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM9_PF_GPIOA_DIO06                   ((uint32_t)0X00000001)
#define IOMUX_PINCM9_PF_TIMG8_CCP1                    ((uint32_t)0X00000002)
#define IOMUX_PINCM9_PF_SPI0_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM9_PF_I2C1_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM9_PF_TIMG14_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM9_PF_SYSCTL_HFCLKIN                ((uint32_t)0X00000006)
#define IOMUX_PINCM9_PF_TIMG1_CCP1                    ((uint32_t)0X00000007)
#define IOMUX_PINCM9_PF_TIMA_FAULT0                   ((uint32_t)0X00000008)
#define IOMUX_PINCM9_PF_UART0_RTS                     ((uint32_t)0X00000009)
#define IOMUX_PINCM9_PF_TIMA0_CCP2_CMPL               ((uint32_t)0X0000000A)
#define IOMUX_PINCM9_PF_UART1_RX                      ((uint32_t)0X0000000B)
#define IOMUX_PINCM9_PF_TIMA0_CCP2                    ((uint32_t)0X0000000C)
#define IOMUX_PINCM9_PF_I2C0_SDA                      ((uint32_t)0X0000000D)
#define IOMUX_PINCM9_PF_SYSCTL_BEEPER                 ((uint32_t)0X0000000E)

/* IOMUX_PINCM10[PF] Bits */
#define IOMUX_PINCM10_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM10_PF_GPIOA_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM10_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000002)
#define IOMUX_PINCM10_PF_TIMG8_CCP0                   ((uint32_t)0X00000003)
#define IOMUX_PINCM10_PF_TIMA0_CCP2                   ((uint32_t)0X00000004)
#define IOMUX_PINCM10_PF_TIMG8_IDX                    ((uint32_t)0X00000005)
#define IOMUX_PINCM10_PF_TIMG2_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM10_PF_TIMA0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM10_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000008)
#define IOMUX_PINCM10_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000009)
#define IOMUX_PINCM10_PF_SPI0_POCI                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM10_PF_SPI0_PICO                    ((uint32_t)0X0000000B)
#define IOMUX_PINCM10_PF_UART1_TX                     ((uint32_t)0X0000000C)
#define IOMUX_PINCM10_PF_TIMG1_CCP0                   ((uint32_t)0X0000000D)
#define IOMUX_PINCM10_PF_COMP0_OUT                    ((uint32_t)0X0000000E)

/* IOMUX_PINCM11[PF] Bits */
#define IOMUX_PINCM11_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM11_PF_GPIOB_DIO02                  ((uint32_t)0X00000001)
#define IOMUX_PINCM11_PF_UART2_CTS                    ((uint32_t)0X00000003)
#define IOMUX_PINCM11_PF_I2C1_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM11_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM11_PF_UART1_CTS                    ((uint32_t)0X00000006)
#define IOMUX_PINCM11_PF_TIMG1_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM11_PF_UART2_TX                     ((uint32_t)0X00000008)
#define IOMUX_PINCM11_PF_SYSCTL_HFCLKIN               ((uint32_t)0X0000000A)
#define IOMUX_PINCM11_PF_SPI0_PICO                    ((uint32_t)0X0000000B)
#define IOMUX_PINCM11_PF_UART1_RX                     ((uint32_t)0X0000000C)
#define IOMUX_PINCM11_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X0000000D)

/* IOMUX_PINCM12[PF] Bits */
#define IOMUX_PINCM12_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM12_PF_GPIOB_DIO03                  ((uint32_t)0X00000001)
#define IOMUX_PINCM12_PF_TIMA_FAULT0                  ((uint32_t)0X00000002)
#define IOMUX_PINCM12_PF_UART2_RTS                    ((uint32_t)0X00000003)
#define IOMUX_PINCM12_PF_I2C1_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM12_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM12_PF_UART1_RTS                    ((uint32_t)0X00000006)
#define IOMUX_PINCM12_PF_TIMG1_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM12_PF_UART2_RX                     ((uint32_t)0X00000008)
#define IOMUX_PINCM12_PF_TIMG2_CCP1                   ((uint32_t)0X00000009)
#define IOMUX_PINCM12_PF_TIMA0_CCP0                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM12_PF_SPI0_SCLK                    ((uint32_t)0X0000000B)
#define IOMUX_PINCM12_PF_SPI0_CS0                     ((uint32_t)0X0000000C)
#define IOMUX_PINCM12_PF_UART1_TX                     ((uint32_t)0X0000000D)
#define IOMUX_PINCM12_PF_LFSS_RTC_OUT                 ((uint32_t)0X0000000E)

