TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0c1105_c1106.h
/* IOMUX_PINCM42[PF] Bits */
#define IOMUX_PINCM42_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM42_PF_GPIOA_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM42_PF_UART2_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM42_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM42_PF_UART0_RTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM42_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM42_PF_TIMG8_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM42_PF_TIMG2_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM42_PF_UART1_RX                     ((uint32_t)0X00000008)
#define IOMUX_PINCM42_PF_TIMG14_CCP1                  ((uint32_t)0X00000009)
#define IOMUX_PINCM42_PF_SPI0_PICO                    ((uint32_t)0X0000000C)
#define IOMUX_PINCM42_PF_I2C0_SDA                     ((uint32_t)0X0000000D)

/* IOMUX_PINCM43[PF] Bits */
#define IOMUX_PINCM43_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM43_PF_GPIOA_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM43_PF_SPI0_PICO                    ((uint32_t)0X00000002)
#define IOMUX_PINCM43_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM43_PF_SPI0_SCLK                    ((uint32_t)0X00000004)
#define IOMUX_PINCM43_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM43_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM43_PF_TIMA0_CCP2                   ((uint32_t)0X00000007)
#define IOMUX_PINCM43_PF_UART2_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM43_PF_TIMG14_CCP0                  ((uint32_t)0X00000009)
#define IOMUX_PINCM43_PF_TIMG1_CCP0                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM43_PF_I2C0_SDA                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM43_PF_UART0_TX                     ((uint32_t)0X0000000C)
#define IOMUX_PINCM43_PF_TIMA_FAULT2                  ((uint32_t)0X0000000D)
#define IOMUX_PINCM43_PF_I2C0_SCL                     ((uint32_t)0X0000000E)

/* IOMUX_PINCM44[PF] Bits */
#define IOMUX_PINCM44_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM44_PF_GPIOA_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM44_PF_SYSCTL_BEEPER                ((uint32_t)0X00000002)
#define IOMUX_PINCM44_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM44_PF_TIMG8_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM44_PF_TIMA_FAULT0                  ((uint32_t)0X00000005)
#define IOMUX_PINCM44_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM44_PF_TIMG2_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM44_PF_UART2_RTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM44_PF_I2C0_SCL                     ((uint32_t)0X00000009)
#define IOMUX_PINCM44_PF_TIMG1_CCP1                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM44_PF_UART0_RX                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM44_PF_TIMA0_CCP0                   ((uint32_t)0X0000000C)
#define IOMUX_PINCM44_PF_I2C0_SDA                     ((uint32_t)0X0000000D)
#define IOMUX_PINCM44_PF_UART1_CTS                    ((uint32_t)0X0000000E)

/* IOMUX_PINCM45[PF] Bits */
#define IOMUX_PINCM45_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM45_PF_GPIOA_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM45_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000002)
#define IOMUX_PINCM45_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000003)
#define IOMUX_PINCM45_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM45_PF_TIMA_FAULT2                  ((uint32_t)0X00000005)
#define IOMUX_PINCM45_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM45_PF_TIMG2_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM45_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000008)
#define IOMUX_PINCM45_PF_UART1_CTS                    ((uint32_t)0X00000009)
#define IOMUX_PINCM45_PF_I2C0_SCL                     ((uint32_t)0X0000000A)
#define IOMUX_PINCM45_PF_UART0_TX                     ((uint32_t)0X0000000B)
#define IOMUX_PINCM45_PF_SPI0_POCI                    ((uint32_t)0X0000000C)
#define IOMUX_PINCM45_PF_COMP0_OUT                    ((uint32_t)0X0000000E)

/* IOMUX_PINCM46[PF] Bits */
#define IOMUX_PINCM46_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM46_PF_GPIOA_DIO30                  ((uint32_t)0X00000001)
#define IOMUX_PINCM46_PF_UART0_RX                     ((uint32_t)0X00000004)
#define IOMUX_PINCM46_PF_TIMG8_IDX                    ((uint32_t)0X00000005)
#define IOMUX_PINCM46_PF_TIMA0_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM46_PF_UART1_RTS                    ((uint32_t)0X00000009)
#define IOMUX_PINCM46_PF_TIMG2_CCP1                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM46_PF_TIMG14_CCP2                  ((uint32_t)0X0000000B)
#define IOMUX_PINCM46_PF_I2C0_SDA                     ((uint32_t)0X0000000C)


#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/*@}*/ /* end of group MSPM0C1105_C1106_PeripheralDecl */

/*@}*/ /* end of group MSPM0C1105_C1106_Definitions */

#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_m0p_mspm0c1105_C1106__include */

